; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-7-8)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-1 - location
	p2-0 - location
	p2-3 - location
	p2-5 - location
	p3-1 - location
	p3-2 - location
	p3-4 - location
	p4-0 - location
	p4-2 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s5)
	(at driver3 s2)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s5)
	(empty truck5)
	(at truck6 s0)
	(empty truck6)
	(at truck7 s2)
	(empty truck7)
	(at package1 s3)
	(at package2 s0)
	(at package3 s4)
	(at package4 s2)
	(at package5 s3)
	(at package6 s5)
	(at package7 s3)
	(at package8 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 40)
	(= (time-to-walk p0-1 s0) 40)
	(= (time-to-walk s1 p0-1) 79)
	(= (time-to-walk p0-1 s1) 79)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 25)
	(= (time-to-walk p2-0 s2) 25)
	(= (time-to-walk s0 p2-0) 59)
	(= (time-to-walk p2-0 s0) 59)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 20)
	(= (time-to-walk p2-3 s2) 20)
	(= (time-to-walk s3 p2-3) 90)
	(= (time-to-walk p2-3 s3) 90)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 15)
	(= (time-to-walk p2-5 s2) 15)
	(= (time-to-walk s5 p2-5) 75)
	(= (time-to-walk p2-5 s5) 75)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 83)
	(= (time-to-walk p3-1 s3) 83)
	(= (time-to-walk s1 p3-1) 97)
	(= (time-to-walk p3-1 s1) 97)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 89)
	(= (time-to-walk p3-4 s3) 89)
	(= (time-to-walk s4 p3-4) 70)
	(= (time-to-walk p3-4 s4) 70)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 29)
	(= (time-to-walk p4-0 s4) 29)
	(= (time-to-walk s0 p4-0) 57)
	(= (time-to-walk p4-0 s0) 57)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(= (time-to-walk s4 p4-2) 95)
	(= (time-to-walk p4-2 s4) 95)
	(= (time-to-walk s2 p4-2) 92)
	(= (time-to-walk p4-2 s2) 92)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 92)
	(= (time-to-drive s3 s0) 92)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 100)
	(= (time-to-drive s0 s1) 100)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 84)
	(= (time-to-drive s5 s1) 84)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 56)
	(= (time-to-drive s0 s2) 56)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 43)
	(= (time-to-drive s1 s2) 43)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 13)
	(= (time-to-drive s4 s2) 13)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 54)
	(= (time-to-drive s5 s2) 54)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 66)
	(= (time-to-drive s1 s3) 66)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 79)
	(= (time-to-drive s2 s3) 79)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 18)
	(= (time-to-drive s5 s3) 18)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 39)
	(= (time-to-drive s0 s4) 39)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 36)
	(= (time-to-drive s1 s4) 36)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 31)
	(= (time-to-drive s3 s4) 31)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s2)
	(at driver3 s1)
	(at truck1 s1)
	(at truck2 s2)
	(at truck3 s2)
	(at truck4 s5)
	(at truck7 s3)
	(at package1 s5)
	(at package2 s5)
	(at package3 s1)
	(at package4 s0)
	(at package5 s2)
	(at package6 s1)
	(at package7 s4)
	(at package8 s4)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 1  (driven))) (* 3  (walked))))

)

; plan
1. (board-truck driver3 truck4 s2)
   deleted: (at driver3 s2) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 2 of 16
2. (walk driver2 s5 p2-5)
   deleted: (at driver2 s5)
   added: (at driver2 p2-5)
   changed: (walked) from 0 to 75
   goals met: 2 of 16
3. (walk driver2 p2-5 s2)
   deleted: (at driver2 p2-5)
   added: (at driver2 s2)
   changed: (walked) from 75 to 90
   goals met: 3 of 16
4. (load-truck package4 truck4 s2)
   deleted: (at package4 s2)
   added: (in package4 truck4)
   goals met: 3 of 16
5. (drive-truck truck4 s2 s3 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s3)
   changed: (driven) from 0 to 79
   goals met: 3 of 16
6. (load-truck package1 truck4 s3)
   deleted: (at package1 s3)
   added: (in package1 truck4)
   goals met: 3 of 16
7. (load-truck package5 truck4 s3)
   deleted: (at package5 s3)
   added: (in package5 truck4)
   goals met: 3 of 16
8. (load-truck package7 truck4 s3)
   deleted: (at package7 s3)
   added: (in package7 truck4)
   goals met: 3 of 16
9. (drive-truck truck4 s3 s2 driver3)
   deleted: (at truck4 s3)
   added: (at truck4 s2)
   changed: (driven) from 79 to 158
   goals met: 3 of 16
10. (unload-truck package5 truck4 s2)
   deleted: (in package5 truck4)
   added: (at package5 s2)
   goals met: 4 of 16
11. (drive-truck truck4 s2 s1 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   changed: (driven) from 158 to 201
   goals met: 4 of 16
12. (walk driver2 s2 p4-2)
   deleted: (at driver2 s2)
   added: (at driver2 p4-2)
   changed: (walked) from 90 to 182
   goals met: 3 of 16
13. (drive-truck truck4 s1 s0 driver3)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (driven) from 201 to 301
   goals met: 3 of 16
14. (unload-truck package4 truck4 s0)
   deleted: (in package4 truck4)
   added: (at package4 s0)
   goals met: 4 of 16
15. (load-truck package2 truck4 s0)
   deleted: (at package2 s0)
   added: (in package2 truck4)
   goals met: 4 of 16
16. (load-truck package8 truck4 s0)
   deleted: (at package8 s0)
   added: (in package8 truck4)
   goals met: 4 of 16
17. (drive-truck truck4 s0 s4 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   changed: (driven) from 301 to 340
   goals met: 4 of 16
18. (unload-truck package7 truck4 s4)
   deleted: (in package7 truck4)
   added: (at package7 s4)
   goals met: 5 of 16
19. (unload-truck package8 truck4 s4)
   deleted: (in package8 truck4)
   added: (at package8 s4)
   goals met: 6 of 16
20. (load-truck package3 truck4 s4)
   deleted: (at package3 s4)
   added: (in package3 truck4)
   goals met: 6 of 16
21. (drive-truck truck4 s4 s1 driver3)
   deleted: (at truck4 s4)
   added: (at truck4 s1)
   changed: (driven) from 340 to 376
   goals met: 6 of 16
22. (unload-truck package3 truck4 s1)
   deleted: (in package3 truck4)
   added: (at package3 s1)
   goals met: 7 of 16
23. (drive-truck truck4 s1 s5 driver3)
   deleted: (at truck4 s1)
   added: (at truck4 s5)
   changed: (driven) from 376 to 460
   goals met: 8 of 16
24. (unload-truck package1 truck4 s5)
   deleted: (in package1 truck4)
   added: (at package1 s5)
   goals met: 9 of 16
25. (unload-truck package2 truck4 s5)
   deleted: (in package2 truck4)
   added: (at package2 s5)
   goals met: 10 of 16
26. (load-truck package6 truck4 s5)
   deleted: (at package6 s5)
   added: (in package6 truck4)
   goals met: 10 of 16
27. (drive-truck truck4 s5 s1 driver3)
   deleted: (at truck4 s5)
   added: (at truck4 s1)
   changed: (driven) from 460 to 544
   goals met: 9 of 16
28. (unload-truck package6 truck4 s1)
   deleted: (in package6 truck4)
   added: (at package6 s1)
   goals met: 10 of 16
29. (walk driver2 p4-2 s4)
   deleted: (at driver2 p4-2)
   added: (at driver2 s4)
   changed: (walked) from 182 to 277
   goals met: 10 of 16
30. (board-truck driver2 truck3 s4)
   deleted: (at driver2 s4) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 10 of 16
31. (drive-truck truck3 s4 s2 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   changed: (driven) from 544 to 557
   goals met: 11 of 16
32. (disembark-truck driver2 truck3 s2)
   deleted: (driving driver2 truck3)
   added: (at driver2 s2) (empty truck3)
   goals met: 12 of 16
33. (disembark-truck driver3 truck4 s1)
   deleted: (driving driver3 truck4)
   added: (at driver3 s1) (empty truck4)
   goals met: 13 of 16
34. (walk driver2 s2 p4-2)
   deleted: (at driver2 s2)
   added: (at driver2 p4-2)
   changed: (walked) from 277 to 369
   goals met: 12 of 16
35. (walk driver2 p4-2 s4)
   deleted: (at driver2 p4-2)
   added: (at driver2 s4)
   changed: (walked) from 369 to 464
   goals met: 12 of 16
36. (board-truck driver2 truck1 s4)
   deleted: (at driver2 s4) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 12 of 16
37. (drive-truck truck1 s4 s1 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (driven) from 557 to 593
   goals met: 13 of 16
38. (board-truck driver1 truck4 s1)
   deleted: (at driver1 s1) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 12 of 16
39. (drive-truck truck4 s1 s5 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s5)
   changed: (driven) from 593 to 677
   goals met: 13 of 16
40. (drive-truck truck4 s5 s2 driver1)
   deleted: (at truck4 s5)
   added: (at truck4 s2)
   changed: (driven) from 677 to 731
   goals met: 12 of 16
41. (drive-truck truck1 s1 s2 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (driven) from 731 to 774
   goals met: 11 of 16
42. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 12 of 16
43. (board-truck driver2 truck7 s2)
   deleted: (at driver2 s2) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 11 of 16
44. (drive-truck truck7 s2 s3 driver2)
   deleted: (at truck7 s2)
   added: (at truck7 s3)
   changed: (driven) from 774 to 853
   goals met: 12 of 16
45. (disembark-truck driver1 truck4 s2)
   deleted: (driving driver1 truck4)
   added: (at driver1 s2) (empty truck4)
   goals met: 12 of 16
46. (disembark-truck driver2 truck7 s3)
   deleted: (driving driver2 truck7)
   added: (at driver2 s3) (empty truck7)
   goals met: 12 of 16
47. (walk driver2 s3 p2-3)
   deleted: (at driver2 s3)
   added: (at driver2 p2-3)
   changed: (walked) from 464 to 554
   goals met: 12 of 16
48. (walk driver2 p2-3 s2)
   deleted: (at driver2 p2-3)
   added: (at driver2 s2)
   changed: (walked) from 554 to 574
   goals met: 13 of 16
49. (board-truck driver2 truck4 s2)
   deleted: (at driver2 s2) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 12 of 16
50. (drive-truck truck4 s2 s5 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s5)
   changed: (driven) from 853 to 907
   goals met: 13 of 16
51. (disembark-truck driver2 truck4 s5)
   deleted: (driving driver2 truck4)
   added: (at driver2 s5) (empty truck4)
   goals met: 13 of 16
52. (walk driver2 s5 p2-5)
   deleted: (at driver2 s5)
   added: (at driver2 p2-5)
   changed: (walked) from 574 to 649
   goals met: 13 of 16
53. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 13 of 16
54. (walk driver2 p2-5 s2)
   deleted: (at driver2 p2-5)
   added: (at driver2 s2)
   changed: (walked) from 649 to 664
   goals met: 14 of 16
55. (drive-truck truck1 s2 s1 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (driven) from 907 to 950
   goals met: 15 of 16
56. (disembark-truck driver1 truck1 s1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s1) (empty truck1)
   goals met: 16 of 16
